## Terraform Run Output 🤖
    
#### Format and Style 🖌`failure`
#### Initialization ⚙️`success`
#### Validation 🤖`success`
<details><summary>Validation Output</summary>

```

$ terraform validate
Success! The configuration is valid.

```

</details>

#### Plan 📖`success`
* **Plan: 5 to add, 0 to change, 0 to destroy.**

<details><summary>Show Plan</summary>

```

$ terraform plan
module.adm_iam_roles.tls_private_key.oonidevops: Refreshing state... [id=b49a9fdb9f720320340226016efe24808dd68203]
random_id.artifact_id: Refreshing state... [id=8Ujqew]
random_password.jwt_secret: Refreshing state... [id=none]
module.ansible_inventory.local_file.ansible_inventory: Refreshing state... [id=b6de844ed8d384f890fa6f467502390de843f758]
module.ansible_inventory.null_resource.ansible_update_known_hosts: Refreshing state... [id=236461505953331670]
module.ooniapi_oonirun_deployer.data.aws_caller_identity.current: Reading...
module.ooni_backendproxy.data.aws_ssm_parameter.ubuntu_22_ami: Reading...
module.adm_iam_roles.aws_secretsmanager_secret.oonidevops_deploy_key: Refreshing state... [id=arn:aws:secretsmanager:eu-central-1:905418398257:secret:oonidevops/deploy_key/ssh_key_private-J5OsZt]
module.adm_iam_roles.aws_key_pair.oonidevops: Refreshing state... [id=oonidevops]
module.ooniapi_cluster.aws_cloudwatch_log_group.ooniapi_services: Refreshing state... [id=ooni-ecs-group/ooniapi-ecs-cluster]
module.ooniapi_cluster.aws_iam_role.container_host: Refreshing state... [id=ooniapi-ecs-cluster-container-host-role]
module.ooniapi_oonirun_deployer.aws_iam_policy.codepipeline: Refreshing state... [id=arn:aws:iam::905418398257:policy/service-role/codepipeline-ooniapi-oonirun]
aws_s3_bucket.ooniapi_codepipeline_bucket: Refreshing state... [id=codepipeline-ooniapi-eu-central-1-f148ea7b]
module.ooniapi_oonirun.aws_iam_role.ooniapi_service_task: Refreshing state... [id=ooniapi-service-oonirun-task-role]
module.adm_iam_roles.aws_iam_policy.oonidevops: Refreshing state... [id=arn:aws:iam::905418398257:policy/OONIDevopsPolicy]
module.ooniapi_oonirun_deployer.data.aws_caller_identity.current: Read complete after 1s [id=905418398257]
aws_secretsmanager_secret.jwt_secret: Refreshing state... [id=arn:aws:secretsmanager:eu-central-1:905418398257:secret:oonidevops/ooni_services/jwt_secret-NUESvS]
module.ooniapi_cluster.data.aws_ssm_parameter.ecs_optimized_ami: Reading...
data.aws_availability_zones.available: Reading...
aws_secretsmanager_secret.oonipg_url: Refreshing state... [id=arn:aws:secretsmanager:eu-central-1:905418398257:secret:oonidevops/ooni-tier0-postgres/postgresql_url-w62CTZ]
module.ooniapi_oonirun.aws_acm_certificate.ooniapi_service: Refreshing state... [id=arn:aws:acm:eu-central-1:905418398257:certificate/e62ec439-1e07-44c7-9a65-b0e3c3167b7c]
module.ooni_backendproxy.data.aws_ssm_parameter.ubuntu_22_ami: Read complete after 1s [id=/aws/service/canonical/ubuntu/server/22.04/stable/current/amd64/hvm/ebs-gp2/ami-id]
module.ooniapi_oonirun.aws_cloudwatch_log_group.ooniapi_service: Refreshing state... [id=ooni-ecs-group/ooniapi-service-oonirun]
module.ooniapi_frontend.aws_acm_certificate.ooniapi: Refreshing state... [id=arn:aws:acm:eu-central-1:905418398257:certificate/c5a662a8-8373-46ed-b2f6-73582b0f01c2]
module.oonidevops_github_user.data.aws_iam_policy_document.oonidevops_github: Reading...
module.oonidevops_github_user.data.aws_iam_policy_document.oonidevops_github: Read complete after 0s [id=2291730230]
module.adm_iam_roles.data.aws_iam_policy_document.assume_role: Reading...
module.adm_iam_roles.data.aws_iam_policy_document.assume_role: Read complete after 0s [id=2751286413]
module.ooniapi_oonirun.aws_iam_role_policy.ooniapi_service_task: Refreshing state... [id=ooniapi-service-oonirun-task-role:ooniapi-service-oonirun-task-role]
module.ooniapi_oonirun_deployer.aws_iam_role.codepipeline: Refreshing state... [id=codepipeline-ooniapi-oonirun]
module.ooniapi_cluster.aws_iam_role_policy.container_host: Refreshing state... [id=ooniapi-ecs-cluster-container-host-role:ooniapi-ecs-cluster-instance-role-policy]
module.ooniapi_cluster.aws_iam_instance_profile.container_host: Refreshing state... [id=ooniapi-ecs-cluster]
module.ooniapi_cluster.data.aws_ssm_parameter.ecs_optimized_ami: Read complete after 0s [id=/aws/service/ecs/optimized-ami/amazon-linux-2/recommended]
module.adm_iam_roles.aws_secretsmanager_secret_version.oonidevops_deploy_key: Refreshing state... [id=arn:aws:secretsmanager:eu-central-1:905418398257:secret:oonidevops/deploy_key/ssh_key_private-J5OsZt|terraform-20240310164138349500000001]
data.aws_availability_zones.available: Read complete after 0s [id=eu-central-1]
module.adm_iam_roles.aws_iam_role.oonidevops: Refreshing state... [id=oonidevops]
aws_secretsmanager_secret_version.jwt_secret: Refreshing state... [id=arn:aws:secretsmanager:eu-central-1:905418398257:secret:oonidevops/ooni_services/jwt_secret-NUESvS|terraform-20240310182536838400000005]
module.ooniapi_cluster.aws_ecs_cluster.main: Refreshing state... [id=arn:aws:ecs:eu-central-1:905418398257:cluster/ooniapi-ecs-cluster]
module.oonipg.random_password.pg_password: Refreshing state... [id=none]
aws_codestarconnections_connection.ooniapi: Refreshing state... [id=arn:aws:codestar-connections:eu-central-1:905418398257:connection/6bd492f6-c11d-43ec-92b0-24c47700d528]
module.terraform_state_backend.data.aws_region.current: Reading...
module.network.aws_vpc.main: Refreshing state... [id=vpc-0e382f3ad89286de9]
module.terraform_state_backend.data.aws_region.current: Read complete after 0s [id=eu-central-1]
module.oonipg.aws_secretsmanager_secret.pg_password: Refreshing state... [id=arn:aws:secretsmanager:eu-central-1:905418398257:secret:oonidevops/ooni-tier0-postgres/pg_password-OjzOJC]
module.terraform_state_backend.data.aws_iam_policy_document.bucket_policy[0]: Reading...
module.terraform_state_backend.aws_s3_bucket.default[0]: Refreshing state... [id=oonidevops-dev-terraform-state]
module.terraform_state_backend.data.aws_iam_policy_document.bucket_policy[0]: Read complete after 0s [id=2666303363]
module.terraform_state_backend.data.aws_iam_policy_document.aggregated_policy[0]: Reading...
module.terraform_state_backend.data.aws_iam_policy_document.aggregated_policy[0]: Read complete after 0s [id=2666303363]
module.terraform_state_backend.aws_dynamodb_table.with_server_side_encryption[0]: Refreshing state... [id=oonidevops-dev-terraform-state-lock]
module.ooniapi_oonirun.aws_route53_record.ooniapi_service_validation["oonirun.dev.ooni.io"]: Refreshing state... [id=Z055356431RGCLK3JXZDL__05c891caeb4509d4cd7f9c24d8b6dbd0.oonirun.dev.ooni.io._CNAME]
module.oonipg.aws_secretsmanager_secret_version.pg_password: Refreshing state... [id=arn:aws:secretsmanager:eu-central-1:905418398257:secret:oonidevops/ooni-tier0-postgres/pg_password-OjzOJC|terraform-20240310155428358300000002]
module.ooniapi_frontend.aws_route53_record.ooniapi_cert_validation["api.dev.ooni.io"]: Refreshing state... [id=Z055356431RGCLK3JXZDL__cd4729fc0c282e771d056e719a7bdf4f.api.dev.ooni.io._CNAME]
module.ooniapi_frontend.aws_acm_certificate_validation.ooniapi: Refreshing state... [id=2024-03-10 17:19:18.261 +0000 UTC]
module.ooniapi_oonirun_deployer.aws_iam_policy.codebuild: Refreshing state... [id=arn:aws:iam::905418398257:policy/service-role/codebuild-oonirun-eu-central-1]
module.ooniapi_oonirun_deployer.aws_iam_role.codebuild: Refreshing state... [id=codebuild-ooniapi-oonirun]
module.ooniapi_oonirun_deployer.aws_codebuild_project.ooniapi: Refreshing state... [id=arn:aws:codebuild:eu-central-1:905418398257:project/ooniapi-oonirun]
module.network.aws_internet_gateway.gw: Refreshing state... [id=igw-0c080e9b235ed29d1]
module.network.aws_subnet.main[0]: Refreshing state... [id=subnet-0e7a4478be988463f]
module.ooni_backendproxy.aws_alb_target_group.oonibackend_proxy: Refreshing state... [id=arn:aws:elasticloadbalancing:eu-central-1:905418398257:targetgroup/ooni-backendproxy/f8ec3c5af20fff6f]
module.network.aws_subnet.main[1]: Refreshing state... [id=subnet-0b18966cccfc9d5ef]
module.oonipg.aws_security_group.pg: Refreshing state... [id=sg-0a9cdefae27025e5d]
module.ooni_backendproxy.aws_security_group.nginx_sg: Refreshing state... [id=sg-0a06ff444314a32ea]
module.ooniapi_oonirun.aws_alb_target_group.ooniapi_service_mapped: Refreshing state... [id=arn:aws:elasticloadbalancing:eu-central-1:905418398257:targetgroup/ooniapi-service-oonirun-mapped/11f47c7ba02ce5b5]
module.ooniapi_cluster.aws_security_group.web: Refreshing state... [id=sg-067fbf5952f79c6d0]
module.ooniapi_oonirun.aws_alb_target_group.ooniapi_service_direct: Refreshing state... [id=arn:aws:elasticloadbalancing:eu-central-1:905418398257:targetgroup/ooniapi-service-oonirun-direct/d9d4c36932007629]
module.network.aws_route_table.r: Refreshing state... [id=rtb-0bbf2b9ab4843cb17]
module.oonipg.aws_db_subnet_group.pg: Refreshing state... [id=ooni-tier0-postgres-dbsng]
module.ooni_backendproxy.aws_launch_template.ooni_backendproxy: Refreshing state... [id=lt-02ae2b46369a252fe]
module.ooniapi_cluster.aws_security_group.container_host: Refreshing state... [id=sg-0ba21672c9ad75937]
module.ooniapi_frontend.aws_alb.ooniapi: Refreshing state... [id=arn:aws:elasticloadbalancing:eu-central-1:905418398257:loadbalancer/app/ooni-tier0-api-frontend/52df1e7ac0eb1ea6]
module.ooniapi_oonirun.aws_alb.ooniapi_service: Refreshing state... [id=arn:aws:elasticloadbalancing:eu-central-1:905418398257:loadbalancer/app/ooniapi-service-oonirun/b9f74ff75fec23f6]
module.network.aws_route_table_association.a[0]: Refreshing state... [id=rtbassoc-042ec84b0762fc826]
module.network.aws_route_table_association.a[1]: Refreshing state... [id=rtbassoc-06b1cb607df775424]
module.ooniapi_cluster.aws_launch_template.container_host: Refreshing state... [id=lt-0e328a8671f870c64]
module.terraform_state_backend.aws_s3_bucket_public_access_block.default[0]: Refreshing state... [id=oonidevops-dev-terraform-state]
module.terraform_state_backend.aws_s3_bucket_versioning.default[0]: Refreshing state... [id=oonidevops-dev-terraform-state]
module.terraform_state_backend.aws_s3_bucket_server_side_encryption_configuration.default[0]: Refreshing state... [id=oonidevops-dev-terraform-state]
module.ooni_backendproxy.aws_autoscaling_group.oonibackend_proxy: Refreshing state... [id=ooni-backendproxy-asg-20240310162930616000000001]
module.terraform_state_backend.aws_s3_bucket_policy.default[0]: Refreshing state... [id=oonidevops-dev-terraform-state]
module.ooniapi_frontend.aws_route53_record.ooniapi: Refreshing state... [id=Z055356431RGCLK3JXZDL_api.dev.ooni.io_A]
module.ooniapi_frontend.aws_alb_listener.ooniapi_listener_https: Refreshing state... [id=arn:aws:elasticloadbalancing:eu-central-1:905418398257:listener/app/ooni-tier0-api-frontend/52df1e7ac0eb1ea6/2f500e01e10ba5cd]
module.ooniapi_frontend.aws_alb_listener.ooniapi_listener_http: Refreshing state... [id=arn:aws:elasticloadbalancing:eu-central-1:905418398257:listener/app/ooni-tier0-api-frontend/52df1e7ac0eb1ea6/d9b2448464179cd1]
module.ooniapi_cluster.aws_autoscaling_group.container_host: Refreshing state... [id=ooniapi-ecs-cluster20240310192644083800000003]
module.terraform_state_backend.time_sleep.wait_for_aws_s3_bucket_settings[0]: Refreshing state... [id=2024-03-10T15:06:17Z]
module.terraform_state_backend.aws_s3_bucket_ownership_controls.default[0]: Refreshing state... [id=oonidevops-dev-terraform-state]
module.ooniapi_oonirun.aws_route53_record.ooniapi_service: Refreshing state... [id=Z055356431RGCLK3JXZDL_oonirun.dev.ooni.io_A]
module.ooniapi_oonirun.aws_alb_listener.front_end_https: Refreshing state... [id=arn:aws:elasticloadbalancing:eu-central-1:905418398257:listener/app/ooniapi-service-oonirun/b9f74ff75fec23f6/b7c2581f2b3ac357]
module.ooniapi_oonirun.aws_alb_listener.ooniapi_service_http: Refreshing state... [id=arn:aws:elasticloadbalancing:eu-central-1:905418398257:listener/app/ooniapi-service-oonirun/b9f74ff75fec23f6/f8565f9258861bb5]
module.ooniapi_oonirun.aws_acm_certificate_validation.ooniapi_service: Refreshing state... [id=2024-03-12 12:57:53.26 +0000 UTC]
module.ooni_backendproxy.aws_autoscaling_attachment.oonibackend_proxy: Refreshing state... [id=ooni-backendproxy-asg-20240310162930616000000001-20240310171855273500000002]
module.oonipg.aws_db_instance.pg: Refreshing state... [id=db-27N7Q6XIBNASFCOXN4N7C762L4]
module.ooniapi_frontend.aws_lb_listener_rule.oonidataapi_rule: Refreshing state... [id=arn:aws:elasticloadbalancing:eu-central-1:905418398257:listener-rule/app/ooni-tier0-api-frontend/52df1e7ac0eb1ea6/2f500e01e10ba5cd/65e6f5e3aca0a4e5]
aws_secretsmanager_secret_version.oonipg_url: Refreshing state... [id=arn:aws:secretsmanager:eu-central-1:905418398257:secret:oonidevops/ooni-tier0-postgres/postgresql_url-w62CTZ|terraform-20240310182536837800000004]
aws_route53_record.postgres_dns: Refreshing state... [id=Z091407123AEJO90Z3H6D_postgres.dev.ooni.nu_CNAME]
module.ooniapi_oonirun.aws_ecs_task_definition.ooniapi_service: Refreshing state... [id=ooniapi-service-oonirun-td]
module.ooniapi_oonirun.aws_ecs_service.ooniapi_service: Refreshing state... [id=arn:aws:ecs:eu-central-1:905418398257:service/ooniapi-ecs-cluster/ooniapi-service-oonirun]
module.ooniapi_oonirun_deployer.aws_codepipeline.ooniapi: Refreshing state... [id=ooniapi-oonirun]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.oonidevops_github_user.aws_iam_access_key.oonidevops_github_user will be created
  + resource "aws_iam_access_key" "oonidevops_github_user" {
      + create_date                    = (known after apply)
      + encrypted_secret               = (known after apply)
      + encrypted_ses_smtp_password_v4 = (known after apply)
      + id                             = (known after apply)
      + key_fingerprint                = (known after apply)
      + secret                         = (sensitive value)
      + ses_smtp_password_v4           = (sensitive value)
      + status                         = "Active"
      + user                           = "oonidevops-github"
    }

  # module.oonidevops_github_user.aws_iam_user.oonidevops_github_user will be created
  + resource "aws_iam_user" "oonidevops_github_user" {
      + arn           = (known after apply)
      + force_destroy = false
      + id            = (known after apply)
      + name          = "oonidevops-github"
      + path          = "/"
      + tags          = {
          + "Environment" = "dev"
          + "Name"        = "oonidevops-dev"
          + "Repository"  = "https://github.com/ooni/devops"
        }
      + tags_all      = {
          + "Environment" = "dev"
          + "Name"        = "oonidevops-dev"
          + "Repository"  = "https://github.com/ooni/devops"
        }
      + unique_id     = (known after apply)
    }

  # module.oonidevops_github_user.aws_iam_user_policy.oonidevops_github will be created
  + resource "aws_iam_user_policy" "oonidevops_github" {
      + id          = (known after apply)
      + name        = "OONIDevopsGithubPolicy"
      + name_prefix = (known after apply)
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "vpc-lattice:ListTargets",
                          + "vpc-lattice:ListTargetGroups",
                          + "vpc-lattice:ListTagsForResource",
                          + "vpc-lattice:ListServices",
                          + "vpc-lattice:ListServiceNetworks",
                          + "vpc-lattice:ListServiceNetworkVpcAssociations",
                          + "vpc-lattice:ListServiceNetworkServiceAssociations",
                          + "vpc-lattice:ListRules",
                          + "vpc-lattice:ListListeners",
                          + "vpc-lattice:ListAccessLogSubscriptions",
                          + "vpc-lattice:GetTargetGroup",
                          + "vpc-lattice:GetServiceNetworkVpcAssociation",
                          + "vpc-lattice:GetServiceNetworkServiceAssociation",
                          + "vpc-lattice:GetServiceNetwork",
                          + "vpc-lattice:GetService",
                          + "vpc-lattice:GetRule",
                          + "vpc-lattice:GetResourcePolicy",
                          + "vpc-lattice:GetListener",
                          + "vpc-lattice:GetAuthPolicy",
                          + "vpc-lattice:GetAccessLogSubscription",
                          + "states:List*",
                          + "states:GetExecutionHistory",
                          + "states:Describe*",
                          + "ssm:List*",
                          + "ssm:Get*",
                          + "ssm:Describe*",
                          + "servicediscovery:List*",
                          + "servicediscovery:Get*",
                          + "servicediscovery:DiscoverInstancesRevision",
                          + "servicediscovery:DiscoverInstances",
                          + "secretsmanager:List*",
                          + "secretsmanager:GetResourcePolicy",
                          + "secretsmanager:Describe*",
                          + "s3:List*",
                          + "s3:Get*",
                          + "s3:DescribeJob",
                          + "route53resolver:List*",
                          + "route53resolver:Get*",
                          + "route53domains:View*",
                          + "route53domains:List*",
                          + "route53domains:Get*",
                          + "route53domains:Check*",
                          + "route53:Test*",
                          + "route53:List*",
                          + "route53:Get*",
                          + "route53-recovery-readiness:List*",
                          + "route53-recovery-readiness:Get*",
                          + "route53-recovery-control-config:List*",
                          + "route53-recovery-control-config:GetResourcePolicy",
                          + "route53-recovery-control-config:Describe*",
                          + "route53-recovery-cluster:ListRoutingControls",
                          + "route53-recovery-cluster:Get*",
                          + "rds:List*",
                          + "rds:Download*",
                          + "rds:Describe*",
                          + "logs:TestMetricFilter",
                          + "logs:StopQuery",
                          + "logs:StopLiveTail",
                          + "logs:StartQuery",
                          + "logs:StartLiveTail",
                          + "logs:ListTagsLogGroup",
                          + "logs:ListTagsForResource",
                          + "logs:ListLogDeliveries",
                          + "logs:ListLogAnomalyDetectors",
                          + "logs:ListAnomalies",
                          + "logs:Get*",
                          + "logs:FilterLogEvents",
                          + "logs:Describe*",
                          + "iam:Simulate*",
                          + "iam:List*",
                          + "iam:Get*",
                          + "iam:Generate*",
                          + "elasticloadbalancing:Describe*",
                          + "ecs:List*",
                          + "ecs:Describe*",
                          + "ecr:List*",
                          + "ecr:Get*",
                          + "ecr:Describe*",
                          + "ecr:BatchGet*",
                          + "ecr:BatchCheck*",
                          + "ecr-public:ListTagsForResource",
                          + "ecr-public:GetRepositoryPolicy",
                          + "ecr-public:GetRepositoryCatalogData",
                          + "ecr-public:GetRegistryCatalogData",
                          + "ecr-public:GetAuthorizationToken",
                          + "ecr-public:DescribeRepositories",
                          + "ecr-public:DescribeRegistries",
                          + "ecr-public:DescribeImages",
                          + "ecr-public:DescribeImageTags",
                          + "ecr-public:BatchCheckLayerAvailability",
                          + "ec2messages:Get*",
                          + "ec2:SearchTransitGatewayRoutes",
                          + "ec2:SearchLocalGatewayRoutes",
                          + "ec2:ListSnapshotsInRecycleBin",
                          + "ec2:ListImagesInRecycleBin",
                          + "ec2:Get*",
                          + "ec2:Describe*",
                          + "dynamodb:Scan",
                          + "dynamodb:Query",
                          + "dynamodb:PartiQLSelect",
                          + "dynamodb:List*",
                          + "dynamodb:Get*",
                          + "dynamodb:Describe*",
                          + "dynamodb:BatchGet*",
                          + "codestar-notifications:listTagsForResource",
                          + "codestar-notifications:listNotificationRules",
                          + "codestar-notifications:listEventTypes",
                          + "codestar-notifications:describeNotificationRule",
                          + "codestar-notifications:ListTargets",
                          + "codestar-connections:ListTagsForResource",
                          + "codestar-connections:ListSyncConfigurations",
                          + "codestar-connections:ListRepositorySyncDefinitions",
                          + "codestar-connections:ListRepositoryLinks",
                          + "codestar-connections:ListHosts",
                          + "codestar-connections:ListConnections",
                          + "codestar-connections:GetSyncConfiguration",
                          + "codestar-connections:GetResourceSyncStatus",
                          + "codestar-connections:GetRepositorySyncStatus",
                          + "codestar-connections:GetRepositoryLink",
                          + "codestar-connections:GetHost",
                          + "codestar-connections:GetConnection",
                          + "codepipeline:List*",
                          + "codepipeline:Get*",
                          + "codedeploy:List*",
                          + "codedeploy:Get*",
                          + "codedeploy:BatchGet*",
                          + "codebuild:List*",
                          + "codebuild:DescribeTestCases",
                          + "codebuild:DescribeCodeCoverages",
                          + "codebuild:BatchGet*",
                          + "cloudwatch:List*",
                          + "cloudwatch:Get*",
                          + "cloudwatch:GenerateQuery",
                          + "cloudwatch:Describe*",
                          + "cloudtrail:LookupEvents",
                          + "cloudtrail:List*",
                          + "cloudtrail:Get*",
                          + "cloudtrail:Describe*",
                          + "cloudformation:ValidateTemplate",
                          + "cloudformation:List*",
                          + "cloudformation:Get*",
                          + "cloudformation:Estimate*",
                          + "cloudformation:Detect*",
                          + "cloudformation:Describe*",
                          + "autoscaling:GetPredictiveScalingForecast",
                          + "autoscaling:Describe*",
                          + "appmesh:List*",
                          + "appmesh:Describe*",
                          + "application-autoscaling:ListTagsForResource",
                          + "application-autoscaling:Describe*",
                          + "acm:List*",
                          + "acm:Get*",
                          + "acm:Describe*",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + user        = "oonidevops-github"
    }

  # module.oonidevops_github_user.aws_secretsmanager_secret.oonidevops_github_user_secrets will be created
  + resource "aws_secretsmanager_secret" "oonidevops_github_user_secrets" {
      + arn                            = (known after apply)
      + force_overwrite_replica_secret = false
      + id                             = (known after apply)
      + name                           = "oonidevops/github_user/access_key_json"
      + name_prefix                    = (known after apply)
      + policy                         = (known after apply)
      + recovery_window_in_days        = 30
      + tags                           = {
          + "Environment" = "dev"
          + "Name"        = "oonidevops-dev"
          + "Repository"  = "https://github.com/ooni/devops"
        }
      + tags_all                       = {
          + "Environment" = "dev"
          + "Name"        = "oonidevops-dev"
          + "Repository"  = "https://github.com/ooni/devops"
        }
    }

  # module.oonidevops_github_user.aws_secretsmanager_secret_version.oonidevops_github_user_secrets will be created
  + resource "aws_secretsmanager_secret_version" "oonidevops_github_user_secrets" {
      + arn            = (known after apply)
      + id             = (known after apply)
      + secret_id      = (known after apply)
      + secret_string  = (sensitive value)
      + version_id     = (known after apply)
      + version_stages = (known after apply)
    }

Plan: 5 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```

</details>

|                   |                                    |
|-------------------|------------------------------------|
| Pusher            | @DecFox               |
| Action            |  pull_request          |
| Working Directory |  ./tf/environments/dev |
| Workflow          |  .github/workflows/check_deploy.yml            |
| Last updated      |  Wed, 13 Mar 2024 14:00:03 GMT   |

    